const CONFIG = {
  processServiceURL: 'http://172.16.108.21:8088/qxgl/',
  poiUrl: 'http://vtctest.geo-compass.com/geocmap/api/v1/map/10001000187/publish',
  geojson: {
    'type': 'FeatureCollection',
    'features': [{
      'type': 'Feature',
      'properties': {
        'message': '颐和园',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.2619,
          39.9912
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '圆明园',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.3024,
          40.0082
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '故宫',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.3910,
          39.9141
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '长城',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.0320,
          40.3364
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '香山',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.1850,
          39.9887
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '天坛',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.4068,
          39.8822
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '地坛',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.4094,
          39.9528
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '天安门广场',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.3913,
          39.9070
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '鸟巢',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.3906,
          39.9913
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '什刹海',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.3874,
          39.9374
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '北京植物园',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.2027,
          40.0007
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '北京动物园',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.3324,
          39.9413
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '北京欢乐谷',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.4892,
          39.8670
        ]
      }
    },
    {
      'type': 'Feature',
      'properties': {
        'message': '朝阳公园',
        'iconSize': [
          40,
          40
        ]
      },
      'geometry': {
        'type': 'Point',
        'coordinates': [
          116.4752,
          39.9391
        ]
      }
    }
    ]
  },
  text: {
    '北京动物园': '北京动物园位于北京市西城区西直门外大街，东邻北京展览馆和莫斯科餐厅，占地面积约86公顷，水面8.6公顷。始建于清光绪三十二年(1906年)，是中国开放最早、饲养展出动物种类最多的动物园。饲养展览动物500余种5000多只;海洋鱼类及海洋生物500余种10000多尾。每年接待中外游客600多万人次。是中国最大的动物园之一，也是一所世界知名的动物园。',
    '北京植物园': '北京植物园位于京西香山脚下，隶属于北京市公园管理中心。距市中心23公里。有多条公交可达。北京植物园是一个集科普、科研、游览等功能于一体的综合性植物园，是国家重点建设的植物园之一。北京植物园在海淀区香山公园和玉泉山（西山卧佛寺附近）之间，1956年经国务院批准建立，是集植物科学研究、植物知识普及、游览观赏休憩、种质资源保存、新优植物推广等功能为一体的大型综合性植物园。其规划面积400公顷，现已建成开放游览区200公顷，由植物展览区、名胜古迹区、科研区和自然保护区组成。园内引种栽培植物10000余种（含品种）近150万株。占地900亩左右。收集栽种植物3000余种，是目前我国北方最大的植物园，也是专门从事植物引种驯化理论研究和实验的科研基地。全园以植物展览温室为中心，共13个展室，栽有1500多种热带、亚热带植物，其中有石头花、光棍树、舞蹈兰等珍贵植物。北京植物园是国家级AAAA旅游景区、 中国林业科普基地、 中国野生植物保护科普教育基地、 中国青少年科技教育基地、 中央国家机关思想教育基地、 北京市科普教育基地、 北京市首批精品公园。',
    '朝阳公园': '朝阳公园是国家4A级景区，东西宽约1.5公里，南北长约2.8公里，总规划面积288.7公顷，是北京市四环以内最大的城市公园。1999 年 12 月江泽民同志亲自为朝阳公园题写园名，中央领导同志于1992年、1996年和2004年三次来到朝阳公园参加全民义务植树活动。2006年7月，朝阳公园被朝阳区授予“朝阳公园国际文化展演聚集区”，形成了“春节朝阳国际风情节”、“五一朝阳流行音乐周”、“十一朝阳国际旅游文化节”三大国际时尚文化品牌活动。“海洋沙滩狂欢节”被评为北京市优秀文化活动。FIVB世界沙滩排球大满贯北京赛事将连续五年在朝阳公园沙滩排球主赛场举办。朝阳公园的建设和发展不但改善了生态环境，同时也丰富了市民生活。',
    '地坛': '地坛总面积37.4公顷，呈方型，整个建筑从整体到局部都是遵照我国古代“天圆地方”、“天青地黄”、“天南地北”、“龙凤”、“乾坤”等传统和象征传说构思设计的。地坛现存有方泽坛、皇祇室、宰牲亭、斋宫、神库等古建筑。1925年辟为“京兆公园”，1928年改称“市民公园”后荒废，1957年恢复公园称“地坛公园”，1981年以来，国家投资对古建筑进行了复原整修。1984年5月地坛公园正式售票开放，并定为北京市文物保护单位，2006年6月10日晋升为国家级文物保护单位。地坛近几年，公园按照生态园林与精致园林的规划建设思路，投资千万余元，修缮了古建筑，改造了不良景观，取而代之的是平坦的方砖路面，柏树成行，绿草茵茵的新景点，园内共有植物116种，草坪面积114000多平方米，绿化覆盖率达72%，现存百年以上古树168株，其中300年以上的古树多达80棵。开展适合广大游人喜闻乐见的活动，使昔日的皇家坛庙，今日成为广大游人休憩、游览、娱乐的园林文化旅游胜地。',
    '故宫': '北京故宫是中国明清两代的皇家宫殿，旧称为紫禁城，位于北京中轴线的中心，是中国古代宫廷建筑之精华。是世界上现存规模最大、保存最为完整的木质结构古建筑之一。北京故宫被誉为世界五大宫之首（北京故宫、法国凡尔赛宫、英国白金汉宫、美国白宫、俄罗斯克里姆林宫），是国家AAAAA级旅游景区。北京故宫于明成祖永乐四年（1406年）开始建设，以南京故宫为蓝本营建，到永乐十八年（1420年）建成。它是一座长方形城池，南北长961米，东西宽753米，四面围有高10米的城墙，城外有宽52米的护城河。紫禁城内的建筑分为外朝和内廷两部分。外朝的中心为太和殿、中和殿、保和殿，统称三大殿，是国家举行大典礼的地方。内廷的中心是乾清宫、交泰殿、坤宁宫，统称后三宫，是皇帝和皇后居住的正宫。2014年11月23日，北京故宫吉祥物首度对外亮相，该吉祥物源自中国传统的吉祥龙凤形象，分别为龙“壮壮”和凤“美美”。2019年2月19日-20日，中共北京市委宣传部和故宫博物院将联合于举办“紫禁城上元之夜”文化活动，这是故宫94年来首次开放夜场参观。',
    '鸟巢': '国家体育场(鸟巢)位于北京奥林匹克公园中心区南部，为2008年北京奥运会的主体育场。工程总占地面积21公顷，场内观众坐席约为91000个。举行了奥运会、残奥会开闭幕式、田径比赛及足球比赛决赛。奥运会后成为北京市民参与体育活动及享受体育娱乐的大型专业场所，并成为地标性的体育建筑和奥运遗产。体育场由雅克·赫尔佐格、德梅隆、艾未未以及李兴刚等设计，由北京城建集团负责施工。体育场的形态如同孕育生命的"巢"和摇篮，寄托着人类对未来的希望。设计者们对这个场馆没有做任何多余的处理，把结构暴露在外，因而自然形成了建筑的外观。2003年12月24日开工建设，2008年3月完工，总造价22.67亿元。作为国家标志性建筑，2008年奥运会主体育场，国家体育场结构特点十分显著。体育场为特级体育建筑，大型体育场馆。主体结构设计使用年限100年，耐火等级为一级，抗震设防烈度8度，地下工程防水等级1级。2014年4月中国当代十大建筑评审委员会从中国1000多座地标建筑中，综合年代、规模、艺术性和影响力四项指标，初评出二十个建筑。最终由此产生十大当代建筑。北京鸟巢--国家体育场为初评入围建筑之一 。作为北京2022年冬奥会冰上项目场馆，国家体育场改造工程将于2020年初开工。',
    '什刹海': '什刹海，是北京市历史文化旅游风景区、北京市历史文化保护区。位于市中心城区西城区，毗邻北京城中轴线。水域面积33.6万平方米，与中南海水域一脉相连，是北京内城唯一一处具有开阔水面的开放型景区，也是北京城内面积最大、风貌保存最完整的一片历史街区，在北京城规划建设史上占有独特的地位。在2000年批准的北京25片历史文化保护区中，什刹海地区面积是最大的。什刹海包括前海、后海和西海(又称积水潭)三个水域及临近地区，与"前三海"相呼应，俗称"后三海"。什刹海也写作"十刹海"，四周原有十座佛寺，故有此称。清代起就成为游乐消夏之所，为燕京胜景之一。什刹海景区的不少古建筑在北京城市建设发展史上及政治文化史上占有重要地位，主要代表有恭王府及花园、宋庆龄故居及醇王府、郭沫若纪念馆、钟鼓楼、德胜门箭楼、广化寺、汇通祠、会贤堂。著名的《帝京景物略》中则以"西湖春，秦淮夏，洞庭秋"来赞美什刹海的神韵。什刹海景区风光秀丽，被誉为"北方的水乡"。随着游客的增多，这里逐渐出现了一些古文化商店、小吃街和酒吧等，因此，也成为了京城文化街之一。',
    '天安门广场': '天安门广场，位于北京市中心，地处北京市东城区东长安街，北起天安门，南至正阳门，东起中国国家博物馆，西至人民大会堂，南北长880米，东西宽500米，面积达44万平方米，可容纳100万人举行盛大集会，是世界上最大的城市广场。广场地面全部由经过特殊工艺技术处理的浅色花岗岩条石铺成，中央矗立着人民英雄纪念碑和庄严肃穆的毛主席纪念堂，天安门两边是劳动人民文化宫和中山公园，与天安门浑然一体，共同构成天安门广场。1986年，天安门广场被评为"北京十六景"之一，景观名"天安丽日"。天安门广场记载了中国人民不屈不挠的革命精神和大无畏的英雄气概，五四运动、一·二九运动、五·二〇运动都在这里为中国现代革命史留下了浓重的色彩， 同时还是无数重大政治、历史事件的发生地，是中国从衰落到崛起的历史见证。2018年1月1日7时36分，天安门广场升国旗仪式，首次由人民解放军仪仗队和军乐团执行。',
    '天坛': '天坛始建于明永乐十八年(1420)，是明、清两代皇帝“祭天”“祈谷”的场所，位于正阳门外东侧。坛域北呈圆形，南为方形，寓意“天圆地方”。坛内主要建筑有祈年殿、皇乾殿、圜丘、皇穹宇、斋宫、无梁殿、长廊、双环万寿亭等，还有回音壁、三音石、七星石等名胜古迹。天坛有坛墙两重，形成内外坛。主要建筑在内坛，圜丘坛在南、祈谷坛在北，二坛同在一条南北轴线上。“祈谷坛”，用于春季祈祷丰年，中心建筑是祈年殿。“圜丘坛”，专门用于“冬至”日祭天，中心建筑是一巨大的圆形石台，名“圜丘“。两坛之间以丹陛桥相连。西天门内南侧建有“斋宫”，是祀前皇帝斋戒的居所。西部外坛设有“神乐署”，掌管祭祀乐舞的教习和演奏。',
    '香山': '香山公园位于北京海淀中部，在小西山之山脉东麓，面积约160公顷。香山红叶多达13万株，是北京秋季的主要游览项目，每年观赏红叶期间有数十万游客到香山赏红叶。早在元、明、清时，皇家就在香山营建离宫别院，每逢夏秋时节皇帝都要到此狩猎纳凉。香山寺曾为京西寺庙之冠。2018年10月1日起，公园全面实施游客预约游览制度，每日最大售票量7万张，当日达到最大售票量后即停止售票。香山公园地势崛峻、峰峦叠翠、泉沛林茂。主峰香炉峰俗称鬼见愁海拔557米。园内各类树木26万余株仅古树名木就达5800多株，约占北京城区的四分之一森林覆盖率高达98%。近年被有关部门测定为北京负氧离子最高的地区之一。公园内人与自然和谐相处鸟啼虫鸣松鼠嬉闹于沟壑林间。这里春日繁花似锦、夏时凉爽宜人、冬来银妆素裹。特别是香山红叶最是闻名。每逢霜秋遍山黄栌如火如荼瑰丽无比。词时游人倍增曾被评为“北京新十六景”之一。',
    '颐和园': '颐和园，北京市古代皇家园林，前身为清漪园，坐落在北京西郊，距城区十五公里，占地约二百九十公顷，与圆明园毗邻。它是以昆明湖、万寿山为基址，以杭州西湖为蓝本，汲取江南园林的设计手法而建成的一座大型山水园林，也是保存最完整的一座皇家行宫御苑，被誉为“皇家园林博物馆”，也是国家重点旅游景点。清朝乾隆皇帝继位以前，在北京西郊一带，建起了四座大型皇家园林。乾隆十五年（1750年），乾隆皇帝为孝敬其母孝圣皇后动用448万两百银在这里改建为清漪园，形成了从现清华园到香山长达二十公里的皇家园林区。咸丰十年（1860年），清漪园被英法联军焚毁。光绪十四年（1888年）重建，改称颐和园，作消夏游乐地。光绪二十六年（1900年），颐和园又遭“八国联军”的破坏，珍宝被劫掠一空。清朝灭亡后，颐和园在军阀混战和国民党统治时期，又遭破坏。1961年3月4日，颐和园被公布为第一批全国重点文物保护单位，与同时公布的承德避暑山庄、拙政园、留园并称为中国四大名园，1998年11月被列入《世界遗产名录》。2007年5月8日，颐和园经国家旅游局正式批准为国家5A级旅游景区。 2009年，颐和园入选中国世界纪录协会中国现存最大的皇家园林。',
    '圆明园': '圆明园坐落在北京西北郊，与颐和园相邻，由圆明园、长春园和万春园组成，也叫圆明三园。圆明园是清朝著名的皇家园林之一，面积五千二百余亩，一百五十余景。建筑面积达16万平方米，有“万园之园”之称。清朝皇室每到盛夏时节会来这里理政，故圆明园也称“夏宫”。圆明园始建于1709年（康熙48年），是康熙赐给尚未即位的雍正的园林，用于打发空闲。1722年雍正即位后，拓展原赐园，并在园南增建了正大光明殿和勤政殿以及内阁、六部、军机处储值房，御以“避喧听政”。乾隆年间，圆明园进行了局部增建、改建，在东面新建了长春园，在东南邻并入了万春园，圆明三园的格局基本形成。嘉庆年间，绮春园进行了修缮和拓建，成为主要园居场所之一。道光年间，国力日衰，财力不足，道光皇帝宁愿撤万寿、香山、玉泉“三山”的陈设，罢热河避暑与木兰围猎，但仍对圆明三园有所改建。',
    '长城': '长城又称“万里长城”，是中国古代在不同时期为抵御塞北游牧部落联盟侵袭而修筑的规模浩大的军事工程的统称。长城始建于春秋战国时期，始修于燕王，历史长达2000多年。今天所指的万里长城多指明代修建的长城，它东起鸭绿江，西至内陆地区甘肃省的嘉峪关。国家文物局2012年宣布中国历代长城总长度为21196.18千米，分布于北京、天津、河北、山西、内蒙古、辽宁、吉林、黑龙江、山东、河南、陕西、甘肃、青海等15个省区，包括长城墙体、壕堑、单体建筑、关堡和相关设施等长城遗产43721处。',
    '北京欢乐谷': '北京欢乐谷是国家AAAA级旅游景区、新北京十六景、北京文化创意产业基地，由华侨城集团创办，是集国际化、现代化的主题公园。欢乐谷位于北京市朝阳区东四环四方桥东南角，占地56万平方米。其中，公园一期占地约54万平方米，于2006年7月29日正式开放。公园二期、三期分别占地5万平方米和40多万平方米。公园分别由峡湾森林、亚特兰蒂斯、失落玛雅、爱琴港、香格里拉、甜品王国和欢乐时光七个主题区组成。北京欢乐谷设置了50余项主题景观、10余项主题表演、30多项主题游乐设施、20余项主题游戏及商业辅助设施，每天提供近80场的表演，可以满足不同人群的需要。获得过“中国文化创意产业高成长企业百强”“首都旅游紫禁杯先进集体”“首都文明旅游景区”等荣誉。2019年6月28日，北京欢乐谷五期·香格里拉区正式对外开放，“雅鲁藏布江大漂流”亮相欢乐谷。'
  },
  listPoi: {
    '颐和园': {
      id: 1,
      price: '30',
      grade: '5A景区',
      address: '北京市海淀区新建宫门路19号',
      photo: '颐和园1'
    },
    '圆明园': {
      id: 2,
      price: '25',
      grade: '4A景区',
      address: '北京市海淀区中关村北大街与荷清路交汇处',
      photo: '圆明园1'
    },
    '故宫': {
      id: 3,
      price: '30',
      grade: '5A景区',
      address: '北京市东城区景山前街4号',
      photo: '故宫1'
    },
    '长城': {
      id: 4,
      price: '45',
      grade: '5A景区',
      address: '北京市延庆县军都山关沟古道北口',
      photo: '长城1'
    },
    '香山': {
      id: 5,
      price: '15',
      grade: '4A景区',
      address: '北京市海淀区香山公园买卖街40号',
      photo: '香山1'
    },
    '天坛': {
      id: 6,
      price: '60',
      grade: '5A景区',
      address: '北京市东城区天坛街道天坛东里甲1号',
      photo: '天坛1'
    },
    '地坛': {
      id: 7,
      price: '10',
      grade: '4A景区',
      address: '北京市东城区安定门外大街地坛公园',
      photo: '地坛1'
    },
    '天安门广场': {
      id: 8,
      price: '',
      grade: '',
      address: '北京市东城区东长安街',
      photo: '天安门广场1'
    },
    '鸟巢': {
      id: 9,
      price: '50',
      grade: '',
      address: '北京市朝阳区奥林匹克公园中心',
      photo: '鸟巢1'
    },
    '什刹海': {
      id: 10,
      price: '',
      grade: '4A景区',
      address: '北京市西城区羊房胡同甲23号',
      photo: '什刹海1'
    },
    '北京植物园': {
      id: 11,
      price: '10',
      grade: '4A景区',
      address: '北京市海淀区香山卧佛寺路',
      photo: '植物1'
    },
    '北京动物园': {
      id: 12,
      price: '85',
      grade: '4A景区',
      address: '北京市西城区西直门外大街137号',
      photo: '动物园1'
    },
    '北京欢乐谷': {
      id: 13,
      price: '260',
      grade: '4A景区',
      address: '北京市朝阳区东四环小武基北路',
      photo: '北京欢乐谷1'
    },
    '朝阳公园': {
      id: 14,
      price: '5',
      grade: '4A景区',
      address: '北京市朝阳区麦子店街道南路1号',
      photo: '朝阳1'
    }
  }
};
